; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	instrument12 - instrument
	thermograph1 - mode
	infrared6 - mode
	image5 - mode
	thermograph0 - mode
	thermograph2 - mode
	spectrograph3 - mode
	image7 - mode
	image4 - mode
	GroundStation0 - direction
	GroundStation2 - direction
	Star4 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 image7)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 image7)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument3 image7)
	(supports instrument3 thermograph2)
	(supports instrument3 infrared6)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 thermograph1)
	(supports instrument4 infrared6)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 image4)
	(supports instrument5 thermograph0)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument6 image5)
	(calibration_target instrument6 GroundStation2)
	(supports instrument7 thermograph2)
	(supports instrument7 image4)
	(calibration_target instrument7 Star4)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
	(supports instrument8 image4)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet6)
	(supports instrument9 image5)
	(supports instrument9 spectrograph3)
	(calibration_target instrument9 GroundStation1)
	(supports instrument10 image5)
	(supports instrument10 infrared6)
	(calibration_target instrument10 GroundStation3)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet6)
	(supports instrument11 image7)
	(supports instrument11 image5)
	(calibration_target instrument11 GroundStation1)
	(supports instrument12 thermograph0)
	(supports instrument12 spectrograph3)
	(supports instrument12 thermograph1)
	(calibration_target instrument12 GroundStation1)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation2)
)
(:goal (and
	(pointing satellite0 Star8)
	(pointing satellite4 GroundStation3)
	(pointing satellite5 Planet7)
	(have_image Phenomenon5 thermograph1)
	(have_image Planet6 spectrograph3)
	(have_image Planet7 image5)
	(have_image Star8 spectrograph3)
	(have_image Star8 thermograph2)
	(have_image Star9 infrared6)
	(have_image Star9 thermograph2)
))

)

; plan
1. (turn_to satellite5 planet7 groundstation2)
   deleted: (pointing satellite5 groundstation2)
   added: (pointing satellite5 planet7)
   goals met: 1 of 10
2. (turn_to satellite4 groundstation1 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 groundstation1)
   goals met: 1 of 10
3. (switch_on instrument9 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument9)
   goals met: 1 of 10
4. (calibrate satellite4 instrument9 groundstation1)
   added: (calibrated instrument9)
   goals met: 1 of 10
5. (turn_to satellite4 planet7 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 planet7)
   goals met: 1 of 10
6. (take_image satellite4 planet7 instrument9 image5)
   added: (have_image planet7 image5)
   goals met: 2 of 10
7. (turn_to satellite4 planet6 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 planet6)
   goals met: 2 of 10
8. (turn_to satellite1 groundstation3 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 groundstation3)
   goals met: 2 of 10
9. (turn_to satellite0 groundstation2 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation2)
   goals met: 2 of 10
10. (take_image satellite4 planet6 instrument9 spectrograph3)
   added: (have_image planet6 spectrograph3)
   goals met: 3 of 10
11. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 3 of 10
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 10
13. (calibrate satellite1 instrument4 groundstation3)
   added: (calibrated instrument4)
   goals met: 3 of 10
14. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 3 of 10
15. (turn_to satellite0 star9 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star9)
   goals met: 3 of 10
16. (take_image satellite0 star9 instrument0 thermograph2)
   added: (have_image star9 thermograph2)
   goals met: 4 of 10
17. (turn_to satellite0 star8 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star8)
   goals met: 5 of 10
18. (take_image satellite0 star8 instrument0 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 6 of 10
19. (turn_to satellite1 phenomenon5 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon5)
   goals met: 6 of 10
20. (take_image satellite1 phenomenon5 instrument4 thermograph1)
   added: (have_image phenomenon5 thermograph1)
   goals met: 7 of 10
21. (turn_to satellite1 star9 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 star9)
   goals met: 7 of 10
22. (take_image satellite1 star9 instrument4 infrared6)
   added: (have_image star9 infrared6)
   goals met: 8 of 10
23. (turn_to satellite4 star8 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 star8)
   goals met: 8 of 10
24. (take_image satellite4 star8 instrument9 spectrograph3)
   added: (have_image star8 spectrograph3)
   goals met: 9 of 10
25. (turn_to satellite4 groundstation3 star8)
   deleted: (pointing satellite4 star8)
   added: (pointing satellite4 groundstation3)
   goals met: 10 of 10
